/*
 * Задача 1: «Палиндром»
 *
 * Палиндром — это слово, предложение или последовательность символов,
 * которая читается слева направо так же, как и справа налево. Например,
 * «топот» и «Анна» — палиндромы, а «привет» и «Витя» — нет.
 *
 * Напишите функцию palindrome(str), принимающую как аргумент строку.
 * Функция должна вернуть true, если строка — палиндром, и false, если нет.
 *
 * Считайте, что на вход всегда передаётся слово: то есть знаков препинания
 * и пробелов в аргументе быть не может.
 *
 */

function palindrome(str) {
  // Приводим к рабочему виду
  str = str.toLowerCase()
  // Разделяем слово на буквы
  const word = []
  const signs = ['!', ',', ' ', '.', '"', '?', '', ':', ';']
  for (let i = 0; i < str.length; i++) {
    if (!signs.includes(str[i])) {
      word.push(str[i])
    }
  }
  // Создаем перевернутый массив
  const reversedWord = []
  word.forEach(symbol => {
    reversedWord.unshift(symbol)
  })

  // Сравниваем массив
  for (let i = 0; i < word.length; i++) {
    if (word[i] !== reversedWord[i]) {
      return false
    }
  }
  return true
}

// Протестируйте решение, вызывая функцию с разными аргументами:

// console.log(palindrome('топот')) // должно быть true
// console.log(palindrome('Saippuakivikauppias')) // true
// console.log(palindrome('привет')) // false

/*
 * Бонус. Задача для любознательных. Пусть функция принимает на вход любую строку,
 * но пробелы и знаки препинания не учитывает. Например:
 *
 * palindrome('О, лета тело!'); // true
 *
 */

console.log(
  'Бонус выполнен, "О, лета тело!" равно',
  palindrome('О, лета тело!')
)
